---
kind: property
id: P:Autodesk.Revit.DB.ImageInstance.DrawLayer
source: html/81510a8d-d74e-bf19-dd79-f8909b178d20.htm
---
# Autodesk.Revit.DB.ImageInstance.DrawLayer Property

The layer the ImageInstance will be drawn in.

## Syntax (C#)
```csharp
public DrawLayer DrawLayer { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration